# GetRemovedUsers Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksharingDisplaySettings..::..GetRemovedUsers Method
WorksharingDisplaySettings Class See Also
---
Returns the set of users who have been explicitly removed from the settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ICollection<string> GetRemovedUsers()
```

Visual Basic
---
```text
Public Function GetRemovedUsers As ICollection(Of String)
```

Visual C++
---
```text
public:
ICollection<String^>^ GetRemovedUsers()
```

# ### Return Value
Users who have been explicitly removed from the list.
# See Also
WorksharingDisplaySettings Class
Autodesk.Revit.DB Namespace